# 1) Entenda a diferença entre uma tabela horizontal e uma tabela vertical

Tabelas horizontais são tabelas estruturadas de maneira mais clássica, com os dados tendo as colunas indicando as 'chaves' e as linhas indicando os valores destas chaves. Esse modelo de tabela geralmente é o mais comum por ser mais fácil de se trabalhar, porém dentro de alguns contextos, quando por exemplo, uma aplicação em produção necessita da inserção de uma nova coluna fazendo com que a aplicação precise de um reteste e um novo deploy, a utilização de uma tabela vertical facilita este serviço, pois as tabelas verticais podem abrigar as chaves e os valores em apenas duas colunas, podendo adicionar novas chaves numa coluna já existente (chaves estas, que no caso das tabelas horizontais, seriam colunas), porém trabalhar com dados nesta estrutura acaba sendo um pouco custoso tendo em vista que manter a normalização dos dados neste tipo de tabela é relativamente difícil.


# 2) Encontrar exemplo de tabela vertical e tabela horizontal

In [9]:
#Importando os pacotes
import numpy as np
import pandas as pd
#Fazendo dicionários que servirão para fazer o dataframe (tabela)
data = {'ano': [2014, 2018,2019,2018], 
        'montadora': ["toyota", "honda","honda","nissan"],
        'valor':[30000, 60000, 50000, 100000]
        }
#transformando os dicionários em tabela
df = pd.DataFrame(data)
#mostrando a tabela
df.head()

    ano montadora   valor
0  2014    toyota   30000
1  2018     honda   60000
2  2019     honda   50000
3  2018    nissan  100000

Para o dataframe vertical, utilizaremos o mesmo dataframe que fizemos anteriormente, mas mudaremos sua estruturação com a função stack

In [2]:
df2 = df.set_index('ano').stack().reset_index(name='values').drop('level_1',1) #usando o stack no dataframe original
df2 = pd.DataFrame(df2) #convertendo para dataframe
df2

    ano  values
0  2014  toyota
1  2014   30000
2  2018   honda
3  2018   60000
4  2019   honda
5  2019   50000
6  2018  nissan
7  2018  100000

# 3) Escolher uma variável categórica/nominal na base vertical e usar a função transpose do pandas para transpor a tabela vertical e criar uma tabela de contingência/incidência.

In [3]:
df2_transposed = df2.set_index('ano').transpose()
df2_transposed

ano       2014   2014   2018   2018   2019   2019    2018    2018
values  toyota  30000  honda  60000  honda  50000  nissan  100000

# 4) Entender os conceitos de tabelas de contingência e incidência.

Tabelas de contingência são tabelas que permitem analisar a relação entre duas ou mais variáveis categóricas, seria o equivalente ao scatterplot entre duas variáveis contínuas.

# 5) Estudar a função melt e aplicar nas tabelas.

## Melt

In [4]:
df.melt(id_vars=['ano'], value_vars=['montadora'])

    ano   variable   value
0  2014  montadora  toyota
1  2018  montadora   honda
2  2019  montadora   honda
3  2018  montadora  nissan

In [5]:
df2.melt(id_vars=['ano'])

    ano variable   value
0  2014   values  toyota
1  2014   values   30000
2  2018   values   honda
3  2018   values   60000
4  2019   values   honda
5  2019   values   50000
6  2018   values  nissan
7  2018   values  100000

# 6) Utilizar a função transpose no SQL para atingir o mesmo resultado que o transpose do Pandas.

### Utilizei a seguinte querry no sql:

`SELECT "ano",


  MAX(CASE WHEN valores = 'toyota' THEN ano END) AS 'toyota',
  
  MAX(CASE WHEN valores = 30000 THEN ano END) AS '30000',
  
  MAX(CASE WHEN valores = 'honda' THEN ano END) AS 'honda',
  
  MAX(CASE WHEN valores =60000 then ano END) AS '60000',
  
  MAX(CASE WHEN valores = 'honda' THEN ano END) AS 'honda',
  
  MAX(CASE WHEN valores = 50000 THEN ano END) AS '50000',
  
  MAX(CASE WHEN valores = 'nissan' THEN ano END) AS 'nissan',
  
  MAX(CASE WHEN valores =10000 THEN ano END) AS '100000'


FROM df_2;`

### Que me deu como retorno:



| ano | 2014 | 2014 | 2018 | 2018 |  2018 | 2018 |2019 | 2019 |
|--- |--- |--- |--- |--- |--- |--- |--- |--- |
| values | toyota | 30000 | honda | 60000 |nissan | 100000 | honda | 50000 |